<details ><summary>apply for fundaztic 2025-08-12 04:12:30 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project kokkeanshern/infrastructure#fundaztic has been locked by PR #9
</details>

<details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # oci_artifacts_container_repository.fundaztic will be destroyed
  # (because oci_artifacts_container_repository.fundaztic is not in configuration)
  - resource "oci_artifacts_container_repository" "fundaztic" {
      - billable_size_in_gbs = "0" -> null
      - compartment_id       = "ocid1.compartment.oc1..aaaaaaaanv2iw5bemlavv5suwpfgm3bj44vy32wzjiemxhg7kzqdvywwmopa" -> null
      - created_by           = "ocid1.user.oc1..aaaaaaaatqz6hzvcyjgkiztbzxrym7hfjvofokd4ftux3dlmyay2bqaaaxsa" -> null
      - defined_tags         = {} -> null
      - display_name         = "fundaztic" -> null
      - freeform_tags        = {} -> null
      - id                   = "ocid1.containerrepo.oc1.ap-singapore-1.0.ax1h9bph8nyo.aaaaaaaaslfuaodjlymz6qnekvrypkykuiefk7cuizqrofdeiaijxwb35nga" -> null
      - image_count          = 0 -> null
      - is_immutable         = false -> null
      - is_public            = false -> null
      - layer_count          = 0 -> null
      - layers_size_in_bytes = "0" -> null
      - namespace            = "ax1h9bph8nyo" -> null
      - state                = "AVAILABLE" -> null
      - system_tags          = {} -> null
      - time_created         = "2025-08-11 15:05:02.894 +0000 UTC" -> null
    }

  # oci_artifacts_container_repository.fundaztic-dev will be created
  + resource "oci_artifacts_container_repository" "fundaztic-dev" {
      + billable_size_in_gbs = (known after apply)
      + compartment_id       = "ocid1.compartment.oc1..aaaaaaaanv2iw5bemlavv5suwpfgm3bj44vy32wzjiemxhg7kzqdvywwmopa"
      + created_by           = (known after apply)
      + defined_tags         = (known after apply)
      + display_name         = "fundaztic/dev"
      + freeform_tags        = (known after apply)
      + id                   = (known after apply)
      + image_count          = (known after apply)
      + is_immutable         = false
      + is_public            = false
      + layer_count          = (known after apply)
      + layers_size_in_bytes = (known after apply)
      + namespace            = (known after apply)
      + state                = (known after apply)
      + system_tags          = (known after apply)
      + time_created         = (known after apply)
      + time_last_pushed     = (known after apply)

      + readme (known after apply)
    }

  # oci_artifacts_container_repository.fundaztic-prod will be created
  + resource "oci_artifacts_container_repository" "fundaztic-prod" {
      + billable_size_in_gbs = (known after apply)
      + compartment_id       = "ocid1.compartment.oc1..aaaaaaaanv2iw5bemlavv5suwpfgm3bj44vy32wzjiemxhg7kzqdvywwmopa"
      + created_by           = (known after apply)
      + defined_tags         = (known after apply)
      + display_name         = "fundaztic/prod"
      + freeform_tags        = (known after apply)
      + id                   = (known after apply)
      + image_count          = (known after apply)
      + is_immutable         = false
      + is_public            = false
      + layer_count          = (known after apply)
      + layers_size_in_bytes = (known after apply)
      + namespace            = (known after apply)
      + state                = (known after apply)
      + system_tags          = (known after apply)
      + time_created         = (known after apply)
      + time_last_pushed     = (known after apply)

      + readme (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
oci_artifacts_container_repository.fundaztic: Destroying... [id=ocid1.containerrepo.oc1.ap-singapore-1.0.ax1h9bph8nyo.aaaaaaaaslfuaodjlymz6qnekvrypkykuiefk7cuizqrofdeiaijxwb35nga]
oci_artifacts_container_repository.fundaztic-dev: Creating...
oci_artifacts_container_repository.fundaztic-prod: Creating...
oci_artifacts_container_repository.fundaztic: Destruction complete after 1s
oci_artifacts_container_repository.fundaztic-dev: Creation complete after 1s [id=ocid1.containerrepo.oc1.ap-singapore-1.0.ax1h9bph8nyo.aaaaaaaa5m35rcclicmisoms7les2myx5ib7jn3gahpd4qrgun2lmvoheiua]
oci_artifacts_container_repository.fundaztic-prod: Creation complete after 1s [id=ocid1.containerrepo.oc1.ap-singapore-1.0.ax1h9bph8nyo.aaaaaaaatb2tettyoqlge3tzqemi5ozu4mxe7l245py7mefyabyvfzivam6a]

Apply complete! Resources: 2 added, 0 changed, 1 destroyed.

```
</details>

</details>